laswick/kinetis/phase2_embedded_c/enet.c
/*******************************************************************************
*
* enet.c
*
* Steve Holford
*
* Low level driver for the Kinetis ENET (Ethernet) module.
*
* Copyright (C) 2012 www.laswick.net
*
* This program is free software.  It comes without any warranty, to the extent
* permitted by applicable law.  You can redistribute it and/or modify it under
* the terms of the WTF Public License (WTFPL), Version 2, as published by
* Sam Hocevar.  See http://sam.zoy.org/wtfpl/COPYING for more details.
*
******************************************************************************/
#include <stdlib.h>
#include <string.h>
#include <errno.h>
#include "globalDefs.h"
#include "kinetis.h"
#include "hardware.h"
#include "eth_frame.h"


static unsigned enetWritePolled(void *enetPtr, const void *data, unsigned len);
static unsigned enetReadPolled(void *enetPtr, void *data, unsigned len);
static unsigned enetWriteInterrupt(void *enetPtr, const void *data, unsigned len);
static unsigned enetReadInterrupt(void *enetPtr, void *data, unsigned len);

static unsigned enet0Mac1588Isr(void); 
static unsigned enet0MacTxIsr(void);
static unsigned enet0MacRxIsr(void);
static unsigned enet0MacErrorIsr(void);
    
/*****************************************************************************/
/*
 * Enums and structure to hold per-channel ethernet configuration
 *
 * Note: You need a real legal MAC address if you are doing anything
 * other than testing.
 *
 */

/*****************************************************************************/
/* Physical Kinetis defines
 */
typedef enum enetPins_e {
    PIN_ENET_MDC,
    PIN_ENET_MDIO,
    PIN_ENET_RXER,
    PIN_ENET_RXDV,
    PIN_ENET_RXD0,
    PIN_ENET_RXD1,
    PIN_ENET_TXEN,
    PIN_ENET_TXD0,
    PIN_ENET_TXD1,
    NUM_PINS,
} enetPins_t;

typedef struct enetPin_s {
    unsigned num;
    unsigned port;
    unsigned mux;
} enetPin_t;

typedef struct enetIrq_s {
    unsigned vector;
    unsigned (*isr)(void);
} enetIrq_t;

typedef enum enetIrqHandler_e {
    HND_ENET_MAC_1588_TIMER,
    HND_ENET_MAC_TX,
    HND_ENET_MAC_RX,
    HND_ENET_MAC_ERROR,
    NUM_HANDLERS
} enetIrqHandler_t;

/*****************************************************************************/
/* 
 * Buffers and buffer descriptors
 */

#define ENET_RX_BUFFER_SIZE 256     /* Must be a multiple of 16 */
#define ENET_TX_BUFFER_SIZE 256

#define ENET_NUM_RXBDS 16           /* defines number of BD,s and buffers */
#define ENET_NUM_TXBDS 16

typedef uint8_t enet_rxbuf_t [ENET_RX_BUFFER_SIZE];
typedef uint8_t enet_txbuf_t [ENET_TX_BUFFER_SIZE];

/* Buffer descriptors  MUST BE 16-byte boundary aligned */
static enet_descr_t rxbds[ENET_NUM_RXBDS] __attribute__ ((aligned (16)));
static enet_descr_t txbds[ENET_NUM_TXBDS] __attribute__ ((aligned (16)));

/* Actual buffers MUST BE 16-byte boundary aligned */
static enet_rxbuf_t rxbuffers[ENET_NUM_RXBDS] __attribute__ ((aligned (16)));
static enet_txbuf_t txbuffers[ENET_NUM_TXBDS] __attribute__ ((aligned (16)));

/* Next BD indicies for BD ring */ 
static int next_rxbd;
static int next_txbd;

/*****************************************************************************/
/* 
 * Array of ethernet module control structures, 1 per channel
 * Everything is controlled and accessed through this array
 *
 */

typedef enum enetModule_e {
    ENET_MODULE_0,
    NUM_ENET_MODULES,
} enetModule_t;

typedef struct enet_s {
    enet_map_ptr addr;
    enet_cfg_t config;
    enet_status_t status;
    int phy_auto_req_data;
    enet_descr_t last_rx_packet;
    enetPin_t  pin[NUM_PINS];
    enetIrq_t  irq[NUM_HANDLERS];
    unsigned  (*write)(void *enetPtr, const void *data, unsigned len);
    unsigned  (*read) (void *enetPtr, void *data,       unsigned len);
    volatile uint32_t * simBBPtr;
} enet_t;

static enet_t enetModules[NUM_ENET_MODULES] = {
    [ENET_MODULE_0] = {
        .addr     = ((enet_map_ptr) ENET_ADDR),
        .config   = {
            .phy_addr = 1,
            .autoneg = ENET_AUTONEG_ON,
            .speed = ENET_100BASET,
            .duplex = ENET_DUPLEX_FULL,
            .loopback = ENET_LOOPBACK_OFF,
            .prom = ENET_PROM_OFF,
            .mac_addr = { 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 } },
        .status = {
            .on_off = ENET_OFF,
            .link = ENET_LINK_DOWN,
            .speed = ENET_100BASET,
            .duplex = ENET_DUPLEX_FULL },
        .phy_auto_req_data = 0,
        .last_rx_packet = {
            .status = 0,
            .length = 0,
            .buf_addr = NULL },
        .irq  = {
            [HND_ENET_MAC_1588_TIMER] = {
                .vector   = ISR_ENET_MAC_1588_TIMER,
                .isr      = enet0Mac1588Isr, 
                },
            [HND_ENET_MAC_TX] = {
                .vector   = ISR_ENET_MAC_TX,
                .isr      = enet0MacTxIsr, 
                },
            [HND_ENET_MAC_RX] = {
                .vector   = ISR_ENET_MAC_RX,
                .isr      = enet0MacRxIsr, 
                },
            [HND_ENET_MAC_ERROR] = {
                .vector   = ISR_ENET_MAC_ERROR,
                .isr      = enet0MacErrorIsr, 
                } },
        .pin  = {
            [PIN_ENET_MDC]  = {
                .num   = 1,
                .port  = PORTB,
                .mux   = PORT_MUX_ALT4 },
            [PIN_ENET_MDIO] = {
                .num   = 0,
                .port  = PORTB,
                .mux   = PORT_MUX_ALT4 },
            [PIN_ENET_RXER]  = {
                .num   = 5,
                .port  = PORTA,
                .mux   = PORT_MUX_ALT4 },
            [PIN_ENET_RXDV] = {
                .num   = 14,
                .port  = PORTA,
                .mux   = PORT_MUX_ALT4 },
            [PIN_ENET_RXD0] = {
                .num   = 13,
                .port  = PORTA,
                .mux   = PORT_MUX_ALT4 },
            [PIN_ENET_RXD1] = {
                .num   = 12,
                .port  = PORTA,
                .mux   = PORT_MUX_ALT4 },
            [PIN_ENET_TXEN] = {
                .num   = 15,
                .port  = PORTA,
                .mux   = PORT_MUX_ALT4 },
            [PIN_ENET_TXD0] = {
                .num   = 16,
                .port  = PORTA,
                .mux   = PORT_MUX_ALT4 },
            [PIN_ENET_TXD1] = {
                .num   = 17,
                .port  = PORTA,
                .mux   = PORT_MUX_ALT4 } },
        .read     = enetReadPolled,
        .write    = enetWritePolled,
        .simBBPtr      = SIM_SCGC2_ENET_BB_PTR
    }
};

