laswick/kinetis/phase2_embedded_c/enet.c
/********************************************************************/
int eth_hwaddr_match (uint8_t* a1, uint8_t* a2)
{   
    int i;

    for (i = 0; i < ETH_ADDR_LEN; i++) {
        if (a1[i] != a2[i]) return FALSE;
    }
    return TRUE;
}

int eth_hwaddr_zero (uint8_t* a1)
{   
    int i;

    for (i = 0; i < ETH_ADDR_LEN; i++) {
        if (a1[i] != 0x00) return FALSE;
    }
    return TRUE;
}

int eth_hwaddr_eff (uint8_t* a1)
{   
    int i;

    for (i = 0; i < ETH_ADDR_LEN; i++) {
        if (a1[i] != 0xFF) return FALSE;
    }
    return TRUE;
}

void eth_hwaddr_copy (uint8_t* dest, uint8_t* src)
{   
    int i;

    for (i = 0; i < ETH_ADDR_LEN; i++) {
        dest[i] = src[i];
    }
}

/********************************************************************/
static void phyInit(enet_t *enet)
{
    enet_map_ptr fec = enet->addr;

    fec->mscr = ENET_MSCR_MII_SPEED((2*50/5)+1);
}

/********************************************************************/
static int phyWrite(enet_t *enet, int reg_addr, int data)
{
    enet_map_ptr fec = enet->addr;
	int timeout;

	/* Clear MII interrupt bit */
	fec->eir = ENET_EIR_MII_MASK;

	/* Request phy write */
	fec->mmfr = ENET_MMFR_ST(0x01) | ENET_MMFR_OP(0x01)
	    | ENET_MMFR_PA(enet->config.phy_addr) 
        | ENET_MMFR_RA(reg_addr) | ENET_MMFR_TA(0x02)
        | ENET_MMFR_DATA(data);

	/* Poll for MII interrupt */
    for (timeout = 0; timeout < MII_TIMEOUT; timeout++) {
		if (fec->eir & ENET_EIR_MII_MASK) {
	        fec->eir = ENET_EIR_MII_MASK;
	        return TRUE;
        }
	}

    return FALSE;
}

/********************************************************************/
static int phyRead(enet_t *enet, int reg_addr, int *data)
{
    enet_map_ptr fec = enet->addr;
	int timeout;

	/* Clear MII interrupt bit */
	fec->eir = ENET_EIR_MII_MASK;

	/* Request phy read */
	fec->mmfr = ENET_MMFR_ST(0x01) | ENET_MMFR_OP(0x2)
		| ENET_MMFR_PA(enet->config.phy_addr)
		| ENET_MMFR_RA(reg_addr) | ENET_MMFR_TA(0x02);

	/* Poll for the MII interrupt */
	for (timeout = 0; timeout < MII_TIMEOUT; timeout++) {
		if (fec->eir & ENET_EIR_MII_MASK) {
	        fec->eir = ENET_EIR_MII_MASK;
	        *data = fec->mmfr & 0x0000FFFF;
            return TRUE;
	    }
	}
    
    return FALSE;
}

/********************************************************************/
static int phyReset(enet_t *enet)
{
    int timeout; 
    int phy_data;

    /* Reset the PHY */
    if (!phyWrite(enet, PHY_BMCR, PHY_BMCR_RESET)) 
        return FALSE;
    for (timeout = 0; timeout < MII_LINK_TIMEOUT; ++timeout) {
        if ((phyRead(enet, PHY_BMCR, &phy_data)) && !(phy_data & PHY_BMCR_RESET))
            return TRUE;
    }
    return FALSE;
}

/********************************************************************/
static int phyAutoneg(enet_t *enet)
{
    int timeout;
    int phy_data;
    enet_cfg_t *config = &(enet->config);
    enet_status_t *status = &(enet->status);

    status->link = ENET_LINK_DOWN;
    status->speed = config->speed;
    status->duplex = config->duplex;
    config->loopback = ENET_LOOPBACK_OFF;
    phyReset(enet);

    /* Create Auto-Negotiation Advertisement Data */
    if (config->speed == ENET_10BASET) {
        phy_data = (config->duplex == ENET_DUPLEX_FULL) 
            ? PHY_ANAR_10BT_FDX | PHY_ANAR_10BT 
            : PHY_ANAR_10BT;
    } else {
        phy_data = (config->duplex == ENET_DUPLEX_FULL)  
            ? PHY_ANAR_100BTX_FDX   | 
              PHY_ANAR_100BTX       | 
              PHY_ANAR_10BT_FDX     | 
              PHY_ANAR_10BT
            : PHY_ANAR_10BT_FDX     | 
              PHY_ANAR_10BT;
    }
    
    enet->phy_auto_req_data = phy_data; /* Save for later */
    /* Set the autonegotiate advertisement register */
    if (!phyWrite(enet, PHY_ANAR, phy_data))
        return FALSE;
        
    /* Enable Auto-Negotiation */
    if (!phyWrite(enet, PHY_BMCR, PHY_BMCR_AN_ENABLE | PHY_BMCR_AN_RESTART))
        return FALSE;

    /* Wait for auto-negotiation to complete */
    for (timeout = 0; timeout < MII_LINK_TIMEOUT; ++timeout) {
        if (!phyRead(enet, PHY_BMSR, &phy_data))
            return FALSE;
        if (phy_data & PHY_BMSR_AN_COMPLETE)
            break;
    }
    /* Read the BMSR one last time */
    if (!phyRead(enet, PHY_BMSR, &phy_data))
        return FALSE;
    if (timeout == MII_LINK_TIMEOUT || !(phy_data & PHY_BMSR_LINK))
        return FALSE;

    status->link = ENET_LINK_UP;
    return TRUE;
}

/********************************************************************/
static int phyManual(enet_t *enet)
{
    int timeout; 
    int phy_data = 0;
    enet_cfg_t *config = &(enet->config);
    enet_status_t *status = &(enet->status);

    status->link = ENET_LINK_DOWN;
    status->speed = config->speed;
    status->duplex = config->duplex;
    enet->phy_auto_req_data = 0;
    phyReset(enet);
  
    if (config->loopback == ENET_LOOPBACK_INT)
        phy_data |= PHY_BMCR_LOOP;
    if (config->duplex == ENET_DUPLEX_FULL)
        phy_data |= PHY_BMCR_FDX;
    if (config->speed == ENET_100BASET)
        phy_data |= PHY_BMCR_SPEED;

    if (!phyWrite(enet, PHY_BMCR, phy_data))
        return FALSE;
    
    /* Wait for link */
    for (timeout = 0; timeout < MII_LINK_TIMEOUT; ++timeout) {
        if (!phyRead(enet, PHY_BMSR, &phy_data))
            return FALSE;
        if (phy_data & PHY_BMSR_LINK)
            break;
    }
    if (timeout == MII_LINK_TIMEOUT || !(phy_data & PHY_BMSR_LINK))
        return FALSE;

    status->link = ENET_LINK_UP;
    return TRUE;
}

/********************************************************************/
static int phyGetAutoResults(enet_t *enet)
{
    int timeout;
    int phy_data = 0;
    enet_status_t *status = &(enet->status);

    for (timeout = 0; timeout < MII_TIMEOUT; ++timeout) {
        if (!phyRead(enet, PHY_ANLPAR, &phy_data))
            return FALSE;
        else
            break;
    }
    if (timeout == MII_TIMEOUT)
        return FALSE;
    
    phy_data &= enet->phy_auto_req_data;
    if (phy_data & PHY_ANLPAR_100BT4     ||
        phy_data & PHY_ANLPAR_100BTX_FDX ||
        phy_data & PHY_ANLPAR_100BTX)
        status->speed = ENET_100BASET;
    else
        status->speed = ENET_10BASET;

    if (phy_data & PHY_ANLPAR_100BTX_FDX ||
        phy_data & PHY_ANLPAR_10BTX_FDX)
        status->duplex = ENET_DUPLEX_FULL;
    else
        status->duplex = ENET_DUPLEX_HALF;

