laswick/kinetis/phase2_embedded_c/enet.c
    return TRUE;
}

/********************************************************************/
static int phyGetManualResults(enet_t *enet)
{
    int timeout;
    int phy_data = 0;
    enet_status_t *status = &(enet->status);

    for (timeout = 0; timeout < MII_TIMEOUT; ++timeout) {
        if (!phyRead(enet, PHY_PHYCTRL2, &phy_data))
            return FALSE;
        else
            break;
    }
    if (timeout == MII_TIMEOUT)
        return FALSE;

    phy_data = (phy_data & PHY_PHYCTRL2_OP_MOD_MASK)>>PHY_PHYCTRL2_OP_MOD_SHIFT;
    
    if (phy_data == PHY_PHYCTRL2_MODE_OP_MOD_10MBPS_HD     ||
        phy_data == PHY_PHYCTRL2_MODE_OP_MOD_10MBPS_FD)
        status->speed = ENET_10BASET;
    else
        status->speed = ENET_100BASET;
    
    if (phy_data == PHY_PHYCTRL2_MODE_OP_MOD_10MBPS_HD     ||
        phy_data == PHY_PHYCTRL2_MODE_OP_MOD_100MBPS_HD)
        status->duplex = ENET_DUPLEX_HALF;
    else
        status->duplex = ENET_DUPLEX_FULL;

    return TRUE;
}

/********************************************************************/
static int phySetRemoteLoopback(enet_t *enet)
{
    int timeout;
    int phy_data = 0;
    enet_cfg_t *config = &(enet->config);

    for (timeout = 0; timeout < MII_TIMEOUT; ++timeout) {      
        if (!phyRead(enet, PHY_PHYCTRL1, &phy_data))
            return FALSE;
        else
            break;
    }
    if (timeout == MII_TIMEOUT)
        return FALSE;

    if(config->loopback == ENET_LOOPBACK_EXT)
        phy_data |= PHY_PHYCTRL1_REMOTE_LOOP;
    else      
        phy_data &= ~PHY_PHYCTRL1_REMOTE_LOOP;
    
    if (!phyWrite(enet, PHY_PHYCTRL1, phy_data))
        return FALSE;

    return TRUE;
}

/*******************************************************************************/
static void enetBDRingInit()
{
	int i;

    next_rxbd = 0;
    next_txbd = 0;

	for (i = 0; i < ENET_NUM_RXBDS; i++) {
		rxbds[i].status = ENET_BD_RX_E;
		rxbds[i].length = 0;
		rxbds[i].buf_addr = (uint8_t *)BSWAP32((uint32_t)rxbuffers[i]);
	}
	for (i = 0; i < ENET_NUM_TXBDS; i++) {
		txbds[i].status = 0x0000;
		txbds[i].length = 0;		
        txbds[i].buf_addr = (uint8_t *)BSWAP32((uint32_t)txbuffers[i]);
	}

	/* Last buffer descriptor in each ring needs the wrap bit on */
	rxbds[ENET_NUM_RXBDS - 1].status |= ENET_BD_RX_W;
	rxbds[ENET_NUM_TXBDS - 1].status |= ENET_BD_TX_W;
}

/********************************************************************/
static void enetBDInit(enet_t *enet)
{
    enet_map_ptr fec = enet->addr;
	fec->mrbr = (uint16_t)ENET_RX_BUFFER_SIZE;  
	fec->rdsr = (uint32_t)rxbds;
	fec->tdsr = (uint32_t)txbds;
}
/********************************************************************/
static void enetBDStartRX(enet_t *enet)
{
    enet_map_ptr fec = enet->addr;

	fec->rdar= ENET_RDAR_RDAR_MASK;
    while( !fec->rdar ) { /* if this gets stuck there is a DMA engine problem */
    }
}

/*******************************************************************************/
/*
 * From Freescale's example code
 *
 * Generate the hash table settings for the given address
 *
 * Parameters:
 *  addr    48-bit (6 byte) Address to generate the hash for
 *
 * Return Value:
 *  The 6 most significant bits of the 32-bit CRC result
 */

static uint8_t enetHashAddress(const uint8_t* addr)
{
    uint32_t crc;
    uint8_t byte;
    int i, j;

    crc = 0xFFFFFFFF;
    for(i=0; i<6; ++i) {
        byte = addr[i];
        for(j=0; j<8; ++j) {
            if((byte & 0x01)^(crc & 0x01)) {
                crc >>= 1;
                crc = crc ^ 0xEDB88320;
            }
            else
                crc >>= 1;
            byte >>= 1;
        }
    }
    return (uint8_t)(crc >> 26);
}

/*******************************************************************************/
static void enetSetAddress (enet_map_ptr fec, const uint8_t *mac_addr)
{
    uint8_t crc;

    /* Write the MAC address into the FEC */
    fec->palr = (uint32_t)((mac_addr[0]<<24) | (mac_addr[1]<<16) 
                         | (mac_addr[2]<<8)  |  mac_addr[3]);
    fec->paur = (uint32_t)((mac_addr[4]<<24) | (mac_addr[5]<<16));

    /*
     * Calculate and set the hash for given Physical Address
     * in the  Individual Address Hash registers
     */
    crc = enetHashAddress(mac_addr);
    if(crc >= 32)
        fec->iaur |= (uint32_t)(1 << (crc - 32));
    else
        fec->ialr |= (uint32_t)(1 << crc);
}

/*******************************************************************************/
static void enetReset (enet_t *enet)
{
    enet_map_ptr fec = enet->addr;
    int i;

    fec->ecr = ENET_ECR_RESET_MASK;

    /* Wait at least 8 clock cycles */
    for (i=0; i<10; ++i)
        asm( "NOP" );
}

/*******************************************************************************/
static void enetInit (enet_t *enet)
{
    enet_map_ptr fec = enet->addr;
    enet_cfg_t *config = &(enet->config);
    enet_status_t *status = &(enet->status);

    enetBDRingInit(enet);
    enetReset(enet);
    /* Clear address hash registers */
    fec->ialr = 0;
    fec->iaur = 0;
    fec->galr = 0;
    fec->gaur = 0;

    enetSetAddress(fec, config->mac_addr);

    /* Mask interrupts */
    fec->eimr = 0;

    /* Clear old interrupt events */
    fec->eir = 0xFFFFFFFF;
    
    /* Init Receive Control Register */
    fec->rcr = ENET_RCR_MAX_FL(ETH_MAX_FRM)
        | ENET_RCR_MII_MODE_MASK 
        | ENET_RCR_CRCFWD_MASK
        | ENET_RCR_RMII_MODE_MASK;
      
    phyInit(enet);
    if (config->autoneg == ENET_AUTONEG_ON) {
        phyAutoneg(enet);
        phyGetAutoResults(enet);
    } else {
        phyManual(enet);
        phyGetManualResults(enet);
        phySetRemoteLoopback(enet);
    }

    if( status->speed == ENET_10BASET )
        fec->rcr |= ENET_RCR_RMII_10T_MASK;
    
    fec->tcr = 0;    
    
    /* Set the duplex */
    if (status->duplex == ENET_DUPLEX_HALF) {      
        fec->rcr |= ENET_RCR_DRT_MASK;
        fec->tcr &= (uint32_t)~ENET_TCR_FDEN_MASK;
    } else {
        fec->rcr &= ~ENET_RCR_DRT_MASK;
        fec->tcr |= ENET_TCR_FDEN_MASK;
    }
    if (config->prom == ENET_PROM_ON)
        fec->rcr |= ENET_RCR_PROM_MASK; 
    
    /* If you use enhanced BD's you need to set IEEE1588 mode here */
    fec->ecr = 0;
    
    /* transmit auto calc and insert IP and Protocol checksums - leave 0 */
    fec->tacc = (ENET_TACC_IPCHK_MASK | ENET_TACC_PROCHK_MASK);
    /* rx,  toss packest with IP, Protocol or Line problems */
    fec->racc = (ENET_RACC_IPDIS_MASK | ENET_RACC_PRODIS_MASK 
        | ENET_RACC_LINEDIS_MASK);

    if(config->loopback == ENET_LOOPBACK_INT)
        fec->rcr |= ENET_RCR_LOOP_MASK;

    enetBDInit(enet);
}

