laswick/kinetis/phase2_embedded_c/enet.c
/*******************************************************************************/
static void enetSetState (enet_t *enet, int new_state)
{
    enet_map_ptr fec = enet->addr;
    enet_status_t *status = &(enet->status);
    enet_cfg_t *config = &(enet->config);

    if (eth_hwaddr_zero(config->mac_addr) || eth_hwaddr_eff(config->mac_addr)) {
        return;
    }

    if (new_state == ENET_ON) {
        if (status->on_off == ENET_OFF) {
            enetInit(enet);
            if (status->link == ENET_LINK_UP) {
                fec->ecr |= ENET_ECR_ETHEREN_MASK;
                enetBDStartRX(enet);
                status->on_off = ENET_ON;
            }
        }
    } else {
        if (status->on_off == ENET_ON) {
            status->on_off = ENET_OFF;
            fec->ecr &= ~ENET_ECR_ETHEREN_MASK;
        }
    }
}

/*******************************************************************************/
static int enetWaitFrameRX(enet_t *enet, int timeout)
{
	int i;
    enet_map_ptr fec = enet->addr;
        
	for (i=0; i < timeout; i++) {
		if (fec->eir & ENET_EIR_RXF_MASK) {
			fec->eir = ENET_EIR_RXF_MASK;
			return TRUE;		
		}
	}
	return FALSE;
}


/*******************************************************************************/
static int enetReadPacket(enet_t *enet, uint8_t* buffer, unsigned maxlen )
{
	int last_buffer;
	uint16_t status;
	int cur_rxbd;
    int read_length;
    enet_descr_t* rx_packet = &(enet->last_rx_packet);

	last_buffer = 0;
	rx_packet->length = 0;
	cur_rxbd = next_rxbd;

    if (maxlen < ETH_MIN_FRM) return -1;
	if(rxbds[cur_rxbd].status & ENET_BD_RX_E) return -1;	

    rx_packet->buf_addr = (uint8_t *)BSWAP32((uint32_t)rxbds[cur_rxbd].buf_addr);

	while(!last_buffer) {
		status = rxbds[cur_rxbd].status;
		rx_packet->length = BSWAP16(rxbds[cur_rxbd].length);
		last_buffer = (status & ENET_BD_RX_L);
		if(status & ENET_BD_RX_W) {
			rxbds[cur_rxbd].status = (ENET_BD_RX_W | ENET_BD_RX_E);
			cur_rxbd = 0;
		} else {
			rxbds[cur_rxbd].status = ENET_BD_RX_E;
			cur_rxbd++;
		}
	}

    read_length = (rx_packet->length < maxlen) ? rx_packet->length : maxlen;

	memcpy((void *)buffer, (void *) rx_packet->buf_addr, read_length);
	next_rxbd = cur_rxbd;
	rx_packet->status = status;
    return read_length;
}

/********************************************************************/
static int enetWritePacket(enet_t *enet, uint8_t* buffer, unsigned len)
{
	int num_txbds;
	int cur_txbd;
    int i;
    uint16_t buf_len;
    unsigned written_len = 0;
    enet_map_ptr fec = enet->addr;

    if (len < ETH_MIN_FRM) return -1;

	cur_txbd = next_txbd;
	num_txbds = (len/ENET_TX_BUFFER_SIZE);
	if((num_txbds * ENET_TX_BUFFER_SIZE) < len) {
		num_txbds = num_txbds + 1;
	}
    
	for (i = 0; i < num_txbds; i++) {
		
		txbds[cur_txbd].status = ENET_BD_TX_TC | ENET_BD_TX_R;
		if(i == num_txbds - 1) {
            buf_len = (uint16_t) len;
		    txbds[cur_txbd].status |= ENET_BD_TX_L;		 
		} else {
            buf_len = (uint16_t) ENET_TX_BUFFER_SIZE;
            len -= ENET_TX_BUFFER_SIZE;
		}
		txbds[cur_txbd].length = BSWAP16(buf_len);
		
        memcpy((void *)BSWAP32((uint32_t)txbds[cur_txbd].buf_addr), 
            (void *)((uint32_t) buffer), buf_len); 

        buffer += buf_len;
        written_len += buf_len;

		if(++cur_txbd == ENET_NUM_TXBDS)
		{
			txbds[ENET_NUM_TXBDS - 1].status |= ENET_BD_TX_W;
			cur_txbd = 0;
		}
	}
	
	next_txbd = cur_txbd;
	fec->tdar = ENET_TDAR_TDAR_MASK; /* Tell FEC to let 'r rip */
    return written_len;
}

/*******************************************************************************/
/* Driver support functions below here
 *
 */

/*******************************************************************************/
static int enetOpen(devoptab_t *dot)
{
    int i;

    if (dot->priv) return FALSE; /* Device is already open */

    enet_t *enet = &enetModules[dot->min];
    enet_status_t *status = &(enet->status);
    dot->priv = enet;

    /* Enable the module in the SIM */
    *enet->simBBPtr = 1;
    MPU_CESR = 0;    /* MPU off */

    /* Throw the Pin Muxes to connect the module to external I/O */
    if (dot->min == 0) {
        SIM_SCGC5 |= SIM_SCGC5_PORTA_ENABLE;
        SIM_SCGC5 |= SIM_SCGC5_PORTB_ENABLE;
    }
    enetPin_t *pin = enet->pin;
    for (i = 0; i < NUM_PINS; i++) {
        PORT_PCR(pin[i].port, pin[i].num) = pin[i].mux;
    }
    status->on_off = ENET_OFF;
    return TRUE;
}

/*******************************************************************************/
static int enetClose(devoptab_t *dot)
{
    enet_t *enet = (enet_t *) dot->priv;
    enet_status_t *status = &(enet->status);

    if (status->link == ENET_LINK_UP) {
        enetSetState(enet, ENET_OFF);
    }
    *enet->simBBPtr = 0;
    dot->priv = NULL;
    return TRUE;
}

/*******************************************************************************/
static unsigned enetWritePolled(void *enetPtr, const void *data, unsigned len)
{
    enet_t * enet = (enet_t *) enetPtr;
    uint8_t *dataPtr = (uint8_t *) data;

    return enetWritePacket(enet, dataPtr, len);
}

/*******************************************************************************/
static unsigned enetReadPolled(void *enetPtr, void *data, unsigned len)
{
    enet_t * enet = (enet_t *) enetPtr;
    uint8_t *dataPtr = (uint8_t *) data;

    return enetReadPacket(enet, dataPtr, len );
}

/*******************************************************************************/
static unsigned enetReadInterrupt(void *enetPtr, void *data, unsigned len)
{
    enet_t * enet = (enet_t *) enetPtr;
    return 0;
}

/*******************************************************************************/
static unsigned enetWriteInterrupt(void *enetPtr, const void *data, unsigned len)
{
    enet_t * enet = (enet_t *) enetPtr;
    return 0;
}

/*******************************************************************************/
static unsigned enetMac1588Isr(enet_t *enet) 
{

    return TRUE;
}


/*******************************************************************************/
static unsigned enetMacTxIsr(enet_t *enet) 
{

