laswick/kinetis/phase2_embedded_c/enet.c
    return TRUE;
}


/*******************************************************************************/
static unsigned enetMacRxIsr(enet_t *enet) 
{

    return TRUE;
}


/*******************************************************************************/
static unsigned enetMacErrorIsr(enet_t *enet) 
{

    return TRUE;
}


/*******************************************************************************/

static unsigned enet0Mac1588Isr(void) 
{
    return enetMac1588Isr(&enetModules[ENET_MODULE_0]);
}

static unsigned enet0MacTxIsr(void) 
{
    return enetMacTxIsr(&enetModules[ENET_MODULE_0]);
}

static unsigned enet0MacRxIsr(void) 
{
    return enetMacRxIsr(&enetModules[ENET_MODULE_0]);
}

static unsigned enet0MacErrorIsr(void) 
{
    return enetMacErrorIsr(&enetModules[ENET_MODULE_0]);
}

/*******************************************************************************/

/*=============================================================================*/
/* POSIX FUNCTIONS                                                             */
/*=============================================================================*/

/*******************************************************************************/
/* enet_open_r                                                                  */
/*******************************************************************************/
/* Jobs of the 'open' syscall:
 *      Check device name
 *      Create a device 'state' structure, hook it to the devoptab private ptr
 *      Enable the SIM SCGC for the device
 *      Initialize the device with a default configuration
 ********************************************************************************/
static int enet_open_r (void *reent, devoptab_t *dot, int mode, int flags )
{

    if (!dot || !dot->name) {
        /* errno ? */
        return FALSE;
    }

    /* Verify module instance */
    if( dot->min >= NUM_ENET_MODULES ) {
        ((struct _reent *)reent)->_errno = ENODEV;
        return FALSE;
    }

    /* Try to open if not already open */
    if (enetOpen(dot)) {
        return TRUE;
    } else {
        /* Device is already open, is this an issue or not? */
        ((struct _reent *)reent)->_errno = EPERM;
        return FALSE;
    }
}

/*******************************************************************************/
/* enet_ioctl_r                                                                 */
/*******************************************************************************/
/* Jobs of the 'ioctl' syscall:
 *      Implement any device specific commands.
 *          Commands are listed in hardware.h in the specific driver section
 *          Commands are NOT standardized however:
 *              See MQX's I/O drivers guide for commands that it supports
 *              These can provide a guide of which commands to implement
 *          Some common commands funtions:
 *              Set baud rate
 *              Set device registers to specific values
 *              Configure I/O pins
 *******************************************************************************/
static int enet_ioctl(devoptab_t *dot, int cmd,  int flags)
{
    if (!dot || !dot->priv) return FALSE;

    enet_t *enet = (enet_t *) dot->priv;
    enet_status_t *status = &(enet->status);
    enet_cfg_t *config = &(enet->config);

    switch (cmd) {
    case IO_IOCTL_ENET_SET_MAC_ADDRESS:
        if (flags == 0) return FALSE;
        eth_hwaddr_copy(config->mac_addr, (uint8_t *)flags);
        break;
    case IO_IOCTL_ENET_SET_ENET_STATE:
        enetSetState(enet, flags);
        break;
    case IO_IOCTL_ENET_GET_ENET_STATE:
        if (flags == 0) return FALSE;
        *((int *)flags) = status->on_off;
        break;
    case IO_IOCTL_ENET_GET_DETAILED_ERROR:
        if (flags == 0) return FALSE;
        break;
    case IO_IOCTL_ENET_SET_AUTONEGOTIATE:
        if (flags == ENET_AUTONEG_OFF)
            config->autoneg = ENET_AUTONEG_OFF;
        else
            config->autoneg = ENET_AUTONEG_ON;
        break;
    case IO_IOCTL_ENET_SET_SPEED:
        if (flags == ENET_10BASET)
            config->speed = ENET_10BASET;
        else
            config->speed = ENET_100BASET;
        break;
    case IO_IOCTL_ENET_SET_DUPLEX:
        if (flags == ENET_DUPLEX_HALF)
            config->duplex = ENET_DUPLEX_HALF;
        else
            config->duplex = ENET_DUPLEX_FULL;
        break;
    case IO_IOCTL_ENET_GET_PHY_CONFIG:
        if (flags == 0) return FALSE;
        *((enet_cfg_t *)flags) = *config;
        break;
    case IO_IOCTL_ENET_GET_PHY_STATUS:
        if (flags == 0) return FALSE;
        *((enet_status_t *)flags) = *status;
        break;
    case IO_IOCTL_ENET_GET_PHY_REG:
        if (flags == 0) return FALSE;
        if ((status->on_off) == ENET_OFF) return FALSE;
        return (phyRead(enet, *(int *)flags, (int *)flags));
        break;
    case IO_IOCTL_ENET_GET_LAST_RXBD:
        if (flags == 0) return FALSE;
        *((enet_descr_t *)flags) = enet->last_rx_packet;
        break;
    default: 
        return FALSE;
    }
    return TRUE;
}

/*******************************************************************************/
/* enet_close_r                                                                 */
/*******************************************************************************/
/* Jobs of the 'close' syscall:
 *      Disable the SIM SCGC for the device
 *      Free the device 'state' structure, unhook it to the devoptab private ptr
 *******************************************************************************/
static int enet_close_r (void *reent, devoptab_t *dot )
{
    if (!dot || !dot->priv) return FALSE;

    return enetClose(dot);
}

/*******************************************************************************/
/* enet_write_r                                                                 */
/*******************************************************************************/
/* Jobs of the 'write' syscall:
 *      Write data to the device.
 *      Return the number of bytes written
 *******************************************************************************/
static long enet_write_r (void *reent, devoptab_t *dot, const void *buf, int len )
{
    if (!dot || !dot->priv) return FALSE;
    enet_t * enet = (enet_t *) dot->priv;
    return enet->write(enet, buf, len);
}

/*******************************************************************************/
/* enet_read_r                                                                  */
/*******************************************************************************/
/* Jobs of the 'read' syscall:
 *      Read data from the device
 *      Return the number of bytes read
 *******************************************************************************/
static long enet_read_r (void *reent, devoptab_t *dot, void *buf, int len )
{
    if (!dot || !dot->priv) return FALSE;
    enet_t * enet = (enet_t *) dot->priv;
    return enet->read(enet, buf, len);
}

/*******************************************************************************/
int enet_install(void)
/*******************************************************************************/
{
    int ret = TRUE;
    if( !deviceInstall(DEV_MAJ_ENET,enet_open_r,  enet_ioctl, enet_close_r,
                                                       enet_write_r, enet_read_r)){
        ret = FALSE;
    }
    if( !deviceRegister("eth0", DEV_MAJ_ENET, ENET_MODULE_0,  NULL) ) {
        ret =  FALSE;
    }
    return ret;
}

